#Использовать gui

Перем ПолеВвода1;


Процедура ПриОткрытииФормы() Экспорт
	// ТестФорма.Закрыть();
КонецПроцедуры

Процедура ПриНажатииНаКнопку() Экспорт
    если ПолеВвода1.НажатАльт тогда
        Сообщить("Альт нажат!");
    КонецЕсли;
    Сообщить("Нажали: " + ПолеВвода1.КодНажатойКлавиши);
КонецПроцедуры

УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
ТестФорма1 = УправляемыйИнтерфейс.СоздатьФорму();
ТестФорма1.СтартоваяПозиция = ПозицияОкнаПриОткрытии.ЦентрЭкрана;
// ТестФорма1.Верх = 100;
// ТестФорма1.Лево = 450;
ТестФорма1.Иконка = "c:\Users\ushakov\Downloads\gconfeditor.ico";
Сообщить(ТестФорма1.Иконка);

ТестФорма1.СостояниеОкна = СостояниеОкна.Обычное;

ПолеВвода1 = ТестФорма1.Элементы.Добавить("ПолеВвода1", "ПолеФормы", Неопределено);
ПолеВвода1.Вид = ТестФорма1.ВидПоляФормы.ПолеВвода;
ПолеВвода1.Заголовок = "Поле ввода";
ПолеВвода1.Значение = "Значение задано из скрипта";

ПолеВвода1.УстановитьДействие(ЭтотОбъект, "ПриНажатииНаКнопку", "ПриНажатииНаКнопку");

// ТестФорма1.ПоверхОкон = Истина;
// Форма = ТестФорма1;

// ВидыПоляФормы = ТестФорма1.ВидПоляФормы;
// ЭлементыФормы = ТестФорма1 .Элементы;
// ПоложениеЗаголовка = ТестФорма1.ПоложениеЗаголовка;

// ТекстовоеПоле3 = ЭлементыФормы.Добавить("Флажок1", "ПолеФормы", ТестФорма1);
// ТекстовоеПоле3.Заголовок = "флажок:";
// ТекстовоеПоле3.Вид = ВидыПоляФормы.ПолеФлажка ;
// ТекстовоеПоле3.Значение = Истина;
// ТекстовоеПоле3.ПоложениеЗаголовка = ПоложениеЗаголовка.верх;


//     ЭлементПолеФлажкаКэш  = Форма.Элементы.Добавить("ЭлементПолеФлажкаКэш", "ПолеФормы", Форма);
//     ЭлементПолеФлажкаКэш.Заголовок = "Очистить кэш";
//     ЭлементПолеФлажкаКэш.Вид       = Форма.ВидПоляФормы.ПолеФлажка;
//     ЭлементПолеФлажкаКэш.ПоложениеЗаголовка = ПоложениеЗаголовка.Право;

// ТестФорма1.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
 
ТестФорма1.Показать();


// Перем Форма;

// Процедура ПолучитьФорму()
//     УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
//     Форма = УправляемыйИнтерфейс.СоздатьФорму();
//     Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
// КонецПроцедуры

// Процедура Инициализация()
// 	ПолучитьФорму();
// КонецПроцедуры

// Процедура ПриОткрытииФормы() Экспорт
//     Сообщить("Открыли форму");
// КонецПроцедуры

// Процедура ПоказатьФорму()
// 	Форма.Показать();
// КонецПроцедуры

// Инициализация();
// ПоказатьФорму();