#Использовать gui

Процедура ПриОткрытииФормы() Экспорт
	// ТестФорма.Закрыть();
КонецПроцедуры

УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
ТестФорма1 = УправляемыйИнтерфейс.СоздатьФорму();
Форма = ТестФорма1;

ВидыПоляФормы = ТестФорма1.ВидПоляФормы;
ЭлементыФормы = ТестФорма1 .Элементы;
ПоложениеЗаголовка = ТестФорма1.ПоложениеЗаголовка;

ТекстовоеПоле3 = ЭлементыФормы.Добавить("Флажок1", "ПолеФормы", ТестФорма1);
ТекстовоеПоле3.Заголовок = "флажок:";
ТекстовоеПоле3.Вид = ВидыПоляФормы.ПолеФлажка ;
ТекстовоеПоле3.Значение = Истина;
ТекстовоеПоле3.ПоложениеЗаголовка = ПоложениеЗаголовка.верх;


    ЭлементПолеФлажкаКэш  = Форма.Элементы.Добавить("ЭлементПолеФлажкаКэш", "ПолеФормы", Форма);
    ЭлементПолеФлажкаКэш.Заголовок = "Очистить кэш";
    ЭлементПолеФлажкаКэш.Вид       = Форма.ВидПоляФормы.ПолеФлажка;
    ЭлементПолеФлажкаКэш.ПоложениеЗаголовка = ПоложениеЗаголовка.Право;

ТестФорма1.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
ТестФорма1.Показать();


// Перем Форма;

// Процедура ПолучитьФорму()
//     УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
//     Форма = УправляемыйИнтерфейс.СоздатьФорму();
//     Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
// КонецПроцедуры

// Процедура Инициализация()
// 	ПолучитьФорму();
// КонецПроцедуры

// Процедура ПриОткрытииФормы() Экспорт
//     Сообщить("Открыли форму");
// КонецПроцедуры

// Процедура ПоказатьФорму()
// 	Форма.Показать();
// КонецПроцедуры

// Инициализация();
// ПоказатьФорму();