#Использовать asserts

Перем юТест;
Перем ВидыПоляФормы;
Перем ПоложенияЗаголовка;
Перем ТекстПриИзменении;

Процедура Инициализация()

КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьПоле");
	СписокТестов.Добавить("Тест_Должен_ПровестиРаботуСоЗначением");
	СписокТестов.Добавить("Тест_Должен_УстановитьЗаголовок");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмя");
	СписокТестов.Добавить("Тест_Должен_УстановитьВидимость");
	СписокТестов.Добавить("Тест_Должен_УстановитьДоступность");
	СписокТестов.Добавить("Тест_Должен_ВернутьРодителя");
	СписокТестов.Добавить("Тест_Должен_УстановитьТолькоПросмотр");
	СписокТестов.Добавить("Тест_Должен_ПроверитьПоложениеЗаголовка");
	
	Возврат СписокТестов;

КонецФункции

Функция ПолучитьФорму()

	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
	ПростойГУИ = Новый ПростойГУИ();
	Форма = ПростойГУИ.СоздатьФорму();

	ВидыПоляФормы = Форма.ВидПоляФормы;
	ПоложенияЗаголовка = Форма.ПоложениеЗаголовка;

	Возврат Форма;

КонецФункции

Процедура Тест_Должен_СоздатьПоле() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();	

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти("Поле1"), Неопределено);

КонецПроцедуры

Процедура Тест_Должен_ПровестиРаботуСоЗначением() Экспорт

	Форма = ПолучитьФорму();
		

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;
	Поле1.Значение = 1;

	Форма.ПоказатьНеМодально();

	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").Значение, 1);

КонецПроцедуры

Процедура Тест_Должен_УстановитьЗаголовок() Экспорт

	НовыйЗаголовок = "Новый заголовок";

	Форма = ПолучитьФорму();
	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;
	Поле1.Заголовок = НовыйЗаголовок;
	Форма.ПоказатьНеМодально();

	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").Заголовок, НовыйЗаголовок);

КонецПроцедуры

Процедура Тест_Должен_УстановитьИмя() Экспорт

	НовоеИмя = "НовоеИмя";

	Форма = ПолучитьФорму();
	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;
	Поле1.Имя = НовоеИмя;
	Форма.ПоказатьНеМодально();

	юТест.ПроверитьРавенство(Форма.Элементы.Найти(НовоеИмя).Имя, НовоеИмя);
КонецПроцедуры

Процедура Тест_Должен_УстановитьВидимость() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;
	Поле1.Видимость = Истина;
	юТест.ПроверитьРавенство(Поле1.Visible, Истина);

	Поле1.Видимость = Ложь;
	юТест.ПроверитьРавенство(Поле1.Visible, Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьДоступность() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;
	Поле1.Доступность = Истина;

	юТест.ПроверитьРавенство(Поле1.Enabled, Истина);

	Поле1.Доступность = Ложь;
	юТест.ПроверитьРавенство(Поле1.Enabled, Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_ВернутьРодителя() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;

	юТест.ПроверитьРавенство(Строка(Форма.Элементы.Найти("Поле1").Родитель), "УправляемаяФорма");

	Группа = Форма.Элементы.Добавить("Группа", "ГруппаФормы", Неопределено);

	Поле2 = Форма.Элементы.Добавить("Поле2", "ПолеФормы", Группа);
	Поле2.Вид = ВидыПоляФормы.ПолеИндикатора;

	юТест.ПроверитьРавенство(Группа.Элементы.Найти("Поле2").Родитель, Форма.Элементы.Найти("Группа"));
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьТолькоПросмотр() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;
	Поле1.ТолькоПросмотр = Истина;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ReadOnly, Истина);

	Поле1.ТолькоПросмотр = Ложь;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ReadOnly, Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_ПроверитьПоложениеЗаголовка() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеИндикатора;
	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Авто;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка, ПоложенияЗаголовка.Авто);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Верх;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка, ПоложенияЗаголовка.Верх);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Лево;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка, ПоложенияЗаголовка.Лево);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Нет;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка, ПоложенияЗаголовка.Нет);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Низ;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка, ПоложенияЗаголовка.Низ);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Право;
	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка, ПоложенияЗаголовка.Право);


КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
