#Использовать asserts

Перем юТест;

Процедура Инициализация()

КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьКнопку");
	СписокТестов.Добавить("Тест_Должен_УстановитьЗаголовок");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмя");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмяИБытьНайден");
	
	СписокТестов.Добавить("Тест_Должен_УстановитьВидимость");
	СписокТестов.Добавить("Тест_Должен_УстановитьДоступность");
	СписокТестов.Добавить("Тест_Должен_ВернутьРодителя");
	СписокТестов.Добавить("Тест_Должен_ОбработатьНажатиеНаКнопку");

	СписокТестов.Добавить("Тест_Должен_ПолучитьДействие");
	

	Возврат СписокТестов;

КонецФункции

Функция ПолучитьФорму()

	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
	ПростойГУИ = Новый ПростойГУИ();
	Возврат ПростойГУИ.СоздатьФорму();

КонецФункции

Процедура Тест_Должен_СоздатьКнопку() Экспорт

	Форма = ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Форма.ПоказатьНеМодально();

	юТест.ПроверитьРавенство(Форма.Элементы.Количество(), 1);

КонецПроцедуры

Процедура Тест_Должен_УстановитьЗаголовок() Экспорт

	НовыйЗаголовок = "Новый заголовок кнопки";

	Форма = ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Заголовок = НовыйЗаголовок;
	Форма.ПоказатьНеМодально();

	юТест.ПроверитьРавенство(Кнопка.Заголовок, НовыйЗаголовок);

КонецПроцедуры

Процедура Тест_Должен_УстановитьИмя() Экспорт

	НовоеИмя = "НовоеИмя";

	Форма = ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Имя = НовоеИмя;
	Форма.ПоказатьНеМодально();

	юТест.ПроверитьРавенство(Кнопка.Имя, НовоеИмя);
КонецПроцедуры

Процедура Тест_Должен_УстановитьИмяИБытьНайден() Экспорт

	НовоеИмя = "НовоеИмя";

	Форма = ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Имя = НовоеИмя;
	Форма.ПоказатьНеМодально();

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти(НовоеИмя), Неопределено);

	
КонецПроцедуры

Процедура Тест_Должен_УстановитьВидимость() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Видимость = Истина;

	юТест.ПроверитьРавенство(Кнопка.Visible, Истина);

	Кнопка.Видимость = Ложь;
	юТест.ПроверитьРавенство(Кнопка.Visible, Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьДоступность() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Доступность = Истина;

	юТест.ПроверитьРавенство(Кнопка.Enabled, Истина);

	Кнопка.Доступность = Ложь;
	юТест.ПроверитьРавенство(Кнопка.Enabled, Ложь);
	
КонецПроцедуры



Процедура Тест_Должен_ВернутьРодителя() Экспорт

	Форма = ПолучитьФорму();
	Форма.ПоказатьНеМодально();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);

	юТест.ПроверитьРавенство(Строка(Кнопка.Родитель), "УправляемаяФорма");

	Группа = Форма.Элементы.Добавить("Группа", "ГруппаФормы", Неопределено);

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "ПолеФормы", Группа);
	юТест.ПроверитьРавенство(Строка(Кнопка2.Родитель), "ГруппаФормы");
	
КонецПроцедуры

Процедура ПриНажатииНаКнопку() Экспорт
	Сообщить("КнопкаНажатие: Нажали на кнопку");
КонецПроцедуры

Процедура ПриНажатииНаКнопку2() Экспорт
	Сообщить("УстановитьДействие: Нажали на кнопку");
КонецПроцедуры


Процедура Тест_Должен_ОбработатьНажатиеНаКнопку() Экспорт
	Форма = ПолучитьФорму();
	
	Кнопка1 = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка1.КнопкаНажатие(ЭтотОбъект,"ПриНажатииНаКнопку");

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "КнопкаФормы", Неопределено);
	Кнопка2.УстановитьДействие(ЭтотОбъект, "Нажатие", "ПриНажатииНаКнопку2");

	Форма.ПоказатьНеМодально();

КонецПроцедуры

Процедура Тест_Должен_ПолучитьДействие() Экспорт
	Форма = ПолучитьФорму();

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "КнопкаФормы", Неопределено);
	Кнопка2.УстановитьДействие(ТекущийСценарий(), "Нажатие", "ПриНажатииНаКнопку2");

	юТест.ПроверитьНеРавенство(Кнопка2.ПолучитьДействие("Нажатие"), "");

	Форма.ПоказатьНеМодально();

КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
