#Использовать asserts
#Использовать gui

Перем ТекстПроверки;
Перем УФ;

Процедура Инициализация() Экспорт
	УФ = Новый УправляемыйИнтерфейс();
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеНет");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеДа");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОК");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОК_ВызовOKCancel");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПовторить_ВызовПовторитьОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОтмена_ВызовПовторитьОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПрервать_ВызовПрерватьПовторитьПропустить");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПовторить_ВызовПрерватьПовторитьПропустить");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПропустить_ВызовПрерватьПовторитьПропустить");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ВернутьЗначениеНет() Экспорт
	
	Ответ = Вопрос("Тест", РежимДиалогаВопрос.ДаНет, 1, КодВозвратаДиалога.Нет , "Заголовок", КодВозвратаДиалога.Нет);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Нет);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеДа() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ДаНет, 1);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.Да);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОтмена() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ДаНетОтмена, 1, УФ.КодВозвратаДиалога.Отмена , "Заголовок", УФ.КодВозвратаДиалога.Отмена);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.Отмена);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОК() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ОК, 1, УФ.КодВозвратаДиалога.ОК , "Заголовок", УФ.КодВозвратаДиалога.ОК);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.ОК);


КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОК_ВызовOKCancel() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.OKCancel, 1, УФ.КодВозвратаДиалога.ОК , "Заголовок", УФ.КодВозвратаДиалога.ОК);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.ОК);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПовторить_ВызовПовторитьОтмена() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ПовторитьОтмена, 1);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.Повторить);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОтмена_ВызовПовторитьОтмена() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ПовторитьОтмена, 1, УФ.КодВозвратаДиалога.Отмена , "Заголовок", УФ.КодВозвратаДиалога.Отмена);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.Отмена);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПрервать_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.Прервать);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПовторить_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1, УФ.КодВозвратаДиалога.Повторить , "Заголовок", УФ.КодВозвратаДиалога.Повторить);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.Повторить);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПропустить_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = УФ.Вопрос("Тест", УФ.РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1, УФ.КодВозвратаДиалога.Пропустить , "Заголовок", УФ.КодВозвратаДиалога.Пропустить);
	Ожидаем.Что(Ответ).Равно(УФ.КодВозвратаДиалога.Пропустить);

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
