#Использовать asserts
#Использовать gui

 Перем ТестФорма1 Экспорт;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ВернутьКоличествоЭлементовНоль");
	
	Возврат СписокТестов;
КонецФункции

Процедура ПриОткрытииФормы() Экспорт
	 ТестФорма1.Закрыть();
КонецПроцедуры

Процедура ПолучитьФормуТест() Экспорт

    УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
    ТестФорма1 = УправляемыйИнтерфейс.СоздатьФорму();
    ТестФорма1.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");

КонецПроцедуры

Процедура Тест_Должен_ВернутьКоличествоЭлементовНоль() Экспорт
	 ПолучитьФормуТест();

	// УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	// ТестФорма1 = УправляемыйИнтерфейс.СоздатьФорму();
	// Сообщить("тип: "+ТестФорма1);
	// ТестФорма1.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	ТестФорма1.Показать();
	Ожидаем.Что(ТестФорма1.Элементы.Количество()).Равно(0);
	
КонецПроцедуры