#Использовать asserts

Перем юТест;
Перем ВидыПоляФормы;
Перем Форма;
Перем ТекстПроверки;
// Перем ПростойГУИ;

Процедура Инициализация()
	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьПоле");
	СписокТестов.Добавить("Тест_Должен_ПеребратьПодчиненныеЭлементы");
	СписокТестов.Добавить("Тест_Должен_ОбработатьПеремещение");
	
	
	// СписокТестов.Добавить("Тест_Должен_ПровестиРаботуСоЗначением");
	// СписокТестов.Добавить("Тест_Должен_УстановитьИПроверитьДействиеПриИзмении");
	// СписокТестов.Добавить("Тест_Должен_ПолучитьДействие");
	
	Возврат СписокТестов;

КонецФункции

//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	Форма.Закрыть();
КонецПроцедуры

Процедура ПолучитьФорму()

	ПростойГУИ = Новый ПростойГУИ();
	Форма = ПростойГУИ.СоздатьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	ВидыПоляФормы = Форма.ВидГруппыФормы;

КонецПроцедуры


Процедура Тест_Должен_СоздатьПоле() Экспорт

	ПолучитьФорму();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ГруппаФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ОбычнаяГруппа;

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти("Поле1"), Неопределено);

	Форма.Показать();

КонецПроцедуры


Процедура Тест_Должен_ПеребратьПодчиненныеЭлементы() Экспорт

	ПолучитьФорму();

	Группа1 = Форма.Элементы.Добавить("Группа1", "ГруппаФормы", Неопределено);
	Группа1.Вид = ВидыПоляФормы.ОбычнаяГруппа;

	Элемент1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Группа1);
	Элемент1.Вид = Форма.ВидПоляФормы.ПолеВвода;

	Элемент1 = Форма.Элементы.Добавить("Поле2", "ПолеФормы", Группа1);
	Элемент1.Вид = Форма.ВидПоляФормы.ПолеВвода;

	СтрГрп1 = "";
	Для каждого Элемент Из Группа1.Элементы Цикл
		СтрГрп1 = СтрГрп1 + "," + Элемент.Имя;
	КонецЦикла;	

	СтрФрм = "";
	Для каждого Элемент Из Форма.Элементы Цикл
		СтрФрм = СтрФрм + "," + Элемент.Имя;
	КонецЦикла;	

	юТест.ПроверитьРавенство(Сред(СтрГрп1,2), "Поле1,Поле2");
	юТест.ПроверитьРавенство(Сред(СтрФрм,2), "Группа1");

	Форма.Показать();

КонецПроцедуры

Процедура Тест_Должен_ОбработатьПеремещение() Экспорт

	ПолучитьФорму();

	Группа1 = Форма.Элементы.Добавить("Группа1", "ГруппаФормы", Неопределено);
	Группа1.Вид = ВидыПоляФормы.ОбычнаяГруппа;

	Группа2 = Форма.Элементы.Добавить("Группа2", "ГруппаФормы", Неопределено);
	Группа2.Вид = ВидыПоляФормы.ОбычнаяГруппа;


	Элемент1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Группа1);
	Элемент1.Вид = Форма.ВидПоляФормы.ПолеВвода;

	Элемент1 = Форма.Элементы.Добавить("Поле2", "ПолеФормы", Группа1);
	Элемент1.Вид = Форма.ВидПоляФормы.ПолеВвода;

	Форма.Элементы.Переместить(Элемент1, Группа2, Неопределено);

	юТест.ПроверитьРавенство(Группа2.Элементы.Количество(), 1);
	юТест.ПроверитьРавенство(Группа1.Элементы.Количество(), 1);
	юТест.ПроверитьРавенство(Форма.Элементы.Количество(), 2);

	Форма.Показать();

КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
