#Использовать asserts
#Использовать gui

Перем Форма;
Перем Соединение;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;

	СписокТестов.Добавить("Тест_Должен_ВернутьКоличествоЭлементовНоль");
	
	Возврат СписокТестов;
КонецФункции

Процедура ПолучитьФорму()

	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	Форма = УправляемыйИнтерфейс.СоздатьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");

КонецПроцедуры

Процедура ПриОткрытииФормы() Экспорт
	Форма.Закрыть();
КонецПроцедуры

Процедура Тест_Должен_ВернутьКоличествоЭлементовНоль() Экспорт

	Форма.Показать();
	Ожидаем.Что(Форма.Элементы.Количество()).Равно(0);
	
КонецПроцедуры