#Использовать asserts

Перем юТест;
Перем Форма;
Перем ТекстПроверки;

Процедура Инициализация()

КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_УстановитьСобытиеПриОткрытии");
	СписокТестов.Добавить("Тест_Должен_УстановитьСобытиеПриЗакрытии");

	СписокТестов.Добавить("Тест_Должен_ПоказатьФормуСЗаголовком");

	Возврат СписокТестов;

КонецФункции

Функция ПолучитьФорму()

	Форма = Неопределено;

	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
	ПростойГУИ = Новый ПростойГУИ();
	Форма = ПростойГУИ.СоздатьФорму();

	Возврат Форма;

КонецФункции


//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	ТекстПроверки = "ПриОткрытииФормы";
	Форма.Закрыть();
КонецПроцедуры

Процедура Тест_Должен_УстановитьСобытиеПриОткрытии() Экспорт

	Форма = ПолучитьФорму();
	ТекстПроверки = "Событие не отработало: ";
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	Форма.Показать();
	
	юТест.ПроверитьРавенство(ТекстПроверки, "ПриОткрытииФормы");

КонецПроцедуры

Процедура ПриЗакрытииФормы() Экспорт
	ТекстПроверки = "ПриЗакрытииФормы";
КонецПроцедуры

Процедура Тест_Должен_УстановитьСобытиеПриЗакрытии() Экспорт

	ТекстПроверки = "Событие не отработало: ";
	Форма = ПолучитьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	Форма.УстановитьДействие(ЭтотОбъект, "ПриЗакрытии", "ПриЗакрытииФормы");
	Форма.Показать();
	

	юТест.ПроверитьРавенство(ТекстПроверки, "ПриЗакрытииФормы");

КонецПроцедуры

Процедура Тест_Должен_ПоказатьФормуСЗаголовком() Экспорт

	Форма = ПолучитьФорму();
	Форма.Заголовок = "ЗаголовокСозданнойФормы";
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	Форма.Показать();
	
	ТекущийЗаголовок = Форма.Заголовок;

	юТест.ПроверитьРавенство(ТекущийЗаголовок, "ЗаголовокСозданнойФормы");

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
