#Использовать asserts
#Использовать gui

Перем Форма;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;

	СписокТестов.Добавить("Тест_Должен_ВернутьКоличествоЭлементовНоль");
	
	Возврат СписокТестов;
КонецФункции

Процедура СоздатьТестовуюФорму() Экспорт
	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	Форма = УправляемыйИнтерфейс.СоздатьФорму();
КонецПроцедуры

//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	Форма.Закрыть();
КонецПроцедуры

Процедура Тест_Должен_ВернутьКоличествоЭлементовНоль() Экспорт

	СоздатьТестовуюФорму();
	Форма.Показать();
	Ожидаем.Что(Форма.Элементы.Количество()).Равно(0);
	
КонецПроцедуры