#Использовать asserts
//#Использовать gui

Перем юТест;
Перем ТекстПроверки;

Процедура Инициализация()
	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеНет");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеДа");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОК");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОК_ВызовOKCancel");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПовторить_ВызовПовторитьОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОтмена_ВызовПовторитьОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПрервать_ВызовПрерватьПовторитьПропустить");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПовторить_ВызовПрерватьПовторитьПропустить");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПропустить_ВызовПрерватьПовторитьПропустить");
	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ВернутьЗначениеНет() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ДаНет, 1, КодВозвратаДиалога.Нет , "Заголовок", КодВозвратаДиалога.Нет);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Нет);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеДа() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ДаНет, 1);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Да);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОтмена() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ДаНетОтмена, 1, КодВозвратаДиалога.Отмена , "Заголовок", КодВозвратаДиалога.Отмена);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Отмена);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОК() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ОК, 1, КодВозвратаДиалога.ОК , "Заголовок", КодВозвратаДиалога.ОК);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.OK);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОК_ВызовOKCancel() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.OKCancel, 1, КодВозвратаДиалога.ОК , "Заголовок", КодВозвратаДиалога.ОК);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.OK);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПовторить_ВызовПовторитьОтмена() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ПовторитьОтмена, 1);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Повторить);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОтмена_ВызовПовторитьОтмена() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ПовторитьОтмена, 1, КодВозвратаДиалога.Отмена , "Заголовок", КодВозвратаДиалога.Отмена);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Отмена);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПрервать_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Прервать);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПовторить_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1, КодВозвратаДиалога.Повторить , "Заголовок", КодВозвратаДиалога.Повторить);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Повторить);
КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПропустить_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = Вопрос("Тест",РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1, КодВозвратаДиалога.Пропустить , "Заголовок", КодВозвратаДиалога.Пропустить);
	юТест.ПроверитьРавенство(Ответ, КодВозвратаДиалога.Пропустить);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
