#Использовать asserts

Перем юТест;
Перем Форма;

Процедура Инициализация()
	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьКнопку");
	СписокТестов.Добавить("Тест_Должен_УстановитьЗаголовок");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмя");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмяИБытьНайден");
	
	СписокТестов.Добавить("Тест_Должен_УстановитьВидимость");
	СписокТестов.Добавить("Тест_Должен_УстановитьДоступность");
	СписокТестов.Добавить("Тест_Должен_ВернутьРодителя");
	СписокТестов.Добавить("Тест_Должен_ОбработатьНажатиеНаКнопку");

	СписокТестов.Добавить("Тест_Должен_ПолучитьДействие");
	

	Возврат СписокТестов;

КонецФункции

//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	Форма.Закрыть();
КонецПроцедуры

Процедура ПолучитьФорму()

	ПростойГУИ = Новый ПростойГУИ();
	Форма = ПростойГУИ.СоздатьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	ВидыПоляФормы = Форма.ВидГруппыФормы;

КонецПроцедуры

Процедура Тест_Должен_СоздатьКнопку() Экспорт

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Форма.Показать();

	юТест.ПроверитьРавенство(Форма.Элементы.Количество(), 1);

КонецПроцедуры

Процедура Тест_Должен_УстановитьЗаголовок() Экспорт

	НовыйЗаголовок = "Новый заголовок кнопки";

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Заголовок = НовыйЗаголовок;
	Форма.Показать();

	юТест.ПроверитьРавенство(Кнопка.Заголовок, НовыйЗаголовок);

КонецПроцедуры

Процедура Тест_Должен_УстановитьИмя() Экспорт

	НовоеИмя = "НовоеИмя";

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Имя = НовоеИмя;
	Форма.Показать();

	юТест.ПроверитьРавенство(Кнопка.Имя, НовоеИмя);
КонецПроцедуры

Процедура Тест_Должен_УстановитьИмяИБытьНайден() Экспорт

	НовоеИмя = "НовоеИмя";

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Имя = НовоеИмя;
	Форма.Показать();

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти(НовоеИмя), Неопределено);

	
КонецПроцедуры

Процедура Тест_Должен_УстановитьВидимость() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Видимость = Истина;

	юТест.ПроверитьРавенство(Кнопка.Visible, Истина);

	Кнопка.Видимость = Ложь;
	юТест.ПроверитьРавенство(Кнопка.Visible, Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьДоступность() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Доступность = Истина;

	юТест.ПроверитьРавенство(Кнопка.Enabled, Истина);

	Кнопка.Доступность = Ложь;
	юТест.ПроверитьРавенство(Кнопка.Enabled, Ложь);
	
КонецПроцедуры



Процедура Тест_Должен_ВернутьРодителя() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);

	юТест.ПроверитьРавенство(Строка(Кнопка.Родитель), "УправляемаяФорма");

	Группа = Форма.Элементы.Добавить("Группа", "ГруппаФормы", Неопределено);

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "ПолеФормы", Группа);
	юТест.ПроверитьРавенство(Строка(Кнопка2.Родитель), "ГруппаФормы");

	Группа1 = Форма.Элементы.Добавить("Группа1", "ГруппаФормы", Неопределено);
	Группа1.Вид = Форма.ВидГруппыФормы.ОбычнаяГруппа;

	Форма.Элементы.Переместить(Кнопка2, Группа1, Неопределено);

	юТест.ПроверитьРавенство(Строка(Кнопка2.Родитель.Имя), "Группа1");

	
КонецПроцедуры

Процедура ПриНажатииНаКнопку() Экспорт
	Сообщить("КнопкаНажатие: Нажали на кнопку");
КонецПроцедуры

Процедура ПриНажатииНаКнопку2() Экспорт
	Сообщить("УстановитьДействие: Нажали на кнопку");
КонецПроцедуры


Процедура Тест_Должен_ОбработатьНажатиеНаКнопку() Экспорт
	ПолучитьФорму();
	
	Кнопка1 = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка1.КнопкаНажатие(ЭтотОбъект,"ПриНажатииНаКнопку");

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "КнопкаФормы", Неопределено);
	Кнопка2.УстановитьДействие(ЭтотОбъект, "Нажатие", "ПриНажатииНаКнопку2");

	Форма.Показать();

КонецПроцедуры

Процедура Тест_Должен_ПолучитьДействие() Экспорт
	ПолучитьФорму();

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "КнопкаФормы", Неопределено);
	Кнопка2.УстановитьДействие(ТекущийСценарий(), "Нажатие", "ПриНажатииНаКнопку2");

	юТест.ПроверитьНеРавенство(Кнопка2.ПолучитьДействие("Нажатие"), "");

	Форма.Показать();

КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
