#Использовать asserts

Перем юТест;
Перем ВидыПоляФормы;
Перем Форма;
Перем ТекстПроверки;
// Перем ПростойГУИ;

Процедура Инициализация()
	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьПоле");
	СписокТестов.Добавить("Тест_Должен_СоздатьСтраницы");
	СписокТестов.Добавить("Тест_Должен_ОбработатьПеремещение");
	
	Возврат СписокТестов;

КонецФункции

//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	Форма.Закрыть();
КонецПроцедуры

Процедура ПолучитьФорму()

	ПростойГУИ = Новый ПростойГУИ();
	Форма = ПростойГУИ.СоздатьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	ВидыПоляФормы = Форма.ВидГруппыФормы;

КонецПроцедуры


Процедура Тест_Должен_СоздатьПоле() Экспорт

	ПолучитьФорму();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ГруппаФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.Страницы;

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти("Поле1"), Неопределено);

	Форма.Показать();

КонецПроцедуры


Процедура Тест_Должен_СоздатьСтраницы() Экспорт

	ПолучитьФорму();

	//# Создание страниц
	Страницы = Форма.Элементы.Добавить("Страницы1", "ГруппаФормы", Неопределено);
	Страницы.Вид = Форма.ВидГруппыФормы.Страницы;
	Страницы.Заголовок = "Страницы";

	Страница1 = Форма.Элементы.Добавить("Страница1", "ГруппаФормы", Страницы);
	Страница1.Вид = Форма.ВидГруппыФормы.Страница;
	Страница1.Заголовок = "Страница1";

	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Страницы1").Элементы.Найти("Страница1"), Страница1);

	Форма.Показать();

КонецПроцедуры

Процедура Тест_Должен_ОбработатьПеремещение() Экспорт

	ПолучитьФорму();

	Страницы1 = Форма.Элементы.Добавить("Страницы1", "ГруппаФормы", Неопределено);
	Страницы1.Вид = Форма.ВидГруппыФормы.Страницы;
	Страницы1.Заголовок = "Страницы";

	Страницы2 = Форма.Элементы.Добавить("Страницы2", "ГруппаФормы", Неопределено);
	Страницы2.Вид = Форма.ВидГруппыФормы.Страницы;
	Страницы2.Заголовок = "Страницы";

	Страница1 = Форма.Элементы.Добавить("Страница1", "ГруппаФормы", Страницы1);
	Страница1.Вид = Форма.ВидГруппыФормы.Страница;
	Страница1.Заголовок = "Страница1";

	Форма.Элементы.Переместить(Страница1, Страницы2, Неопределено);

	юТест.ПроверитьРавенство(Страницы1.Элементы.Количество(), 0);
	юТест.ПроверитьРавенство(Страницы2.Элементы.Количество(), 1);


	Форма.Показать();

КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
