#Использовать asserts

Перем юТест;
Перем ВидыПоляФормы;
Перем Форма;
Перем ТекстПроверки;
// Перем ПростойГУИ;

Процедура Инициализация()
	ПодключитьВнешнююКомпоненту("oscript-component/bin/Release/oscript-simple-gui.dll");
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьПоле");
	СписокТестов.Добавить("Тест_Должен_ПеребратьПодчиненныеЭлементы");
	
	// СписокТестов.Добавить("Тест_Должен_ПровестиРаботуСоЗначением");
	// СписокТестов.Добавить("Тест_Должен_УстановитьИПроверитьДействиеПриИзмении");
	// СписокТестов.Добавить("Тест_Должен_ПолучитьДействие");
	
	Возврат СписокТестов;

КонецФункции

//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	// Форма.Закрыть();
КонецПроцедуры

Процедура ПолучитьФорму()

	ПростойГУИ = Новый ПростойГУИ();
	Форма = ПростойГУИ.СоздатьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	ВидыПоляФормы = Форма.ВидГруппыФормы;

КонецПроцедуры


Процедура Тест_Должен_СоздатьПоле() Экспорт

	ПолучитьФорму();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ГруппаФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ОбычнаяГруппа;

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти("Поле1"), Неопределено);

	Форма.Показать();

КонецПроцедуры


Процедура Тест_Должен_ПеребратьПодчиненныеЭлементы() Экспорт

	ПолучитьФорму();

	Группа1 = Форма.Элементы.Добавить("Группа1", "ГруппаФормы", Неопределено);
	Группа1.Вид = ВидыПоляФормы.ОбычнаяГруппа;

	Элемент1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Группа1);
	Элемент1.Вид = Форма.ВидПоляФормы.ПолеВвода;

	Элемент1 = Форма.Элементы.Добавить("Поле2", "ПолеФормы", Группа1);
	Элемент1.Вид = Форма.ВидПоляФормы.ПолеВвода;

// дддд = Группа1.Элементы;
	Сообщить("Кол: " + Форма.Элементы.Количество());

	ПодчиненныеЭлементы = Форма.Элементы;

	Для каждого Элемент Из ПодчиненныеЭлементы Цикл
		Сообщить("Элемент: " + Элемент);
	КонецЦикла;	

	Сообщить("Всего: " + ПодчиненныеЭлементы.Количество());

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти("Группа1"), Неопределено);

	Форма.Показать();

КонецПроцедуры

Процедура Тест_Должен_ПровестиРаботуСоЗначением() Экспорт

	ПолучитьФорму();
	
	
	СтрЗначение = "Декорация";

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеНадписи;
	Поле1.Значение = СтрЗначение;

	Форма.Показать();

	юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле1").Значение, СтрЗначение);

КонецПроцедуры

//# Работа с событиями
Процедура ПриИзменииЗначения() Экспорт
	ТекстПроверки = "Новое значение: ";
КонецПроцедуры

Процедура Тест_Должен_УстановитьИПроверитьДействиеПриИзмении() Экспорт
	ПолучитьФорму();
	
	СтрЗначение = "Декорация";

	ТекстПроверки = "Событие не отработало: ПриИзменииЗначения: ";
	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеНадписи;
	Поле1.УстановитьДействие(ЭтотОбъект, "ПриИзменении", "ПриИзменииЗначения");
	Поле1.Значение = СтрЗначение;
	Форма.Показать();

	юТест.ПроверитьРавенство(ТекстПроверки + Форма.Элементы.Найти("Поле1").Значение, "Новое значение: " + СтрЗначение);

КонецПроцедуры

Процедура Тест_Должен_ПолучитьДействие() Экспорт
	ПолучитьФорму();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = ВидыПоляФормы.ПолеНадписи;
	Поле1.УстановитьДействие(ЭтотОбъект, "ПриИзменении", "ПриИзменииЗначения");

	юТест.ПроверитьНеРавенство(Форма.Элементы.Найти("Поле1").ПолучитьДействие("ПриИзменении"), "");

	Форма.Показать();

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
