#Использовать asserts

Перем юТест;

Процедура Инициализация()

КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ПоказатьФормуСЗаголовком");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ПоказатьФормуСЗаголовком() Экспорт

	ПодключитьВнешнююКомпоненту("../oscript-component/bin/Release/oscript-simple-gui.dll");
	ПростойГУИ = Новый ПростойГУИ();
	Форма = ПростойГУИ.СоздатьФорму();
	Форма.Заголовок = "ЗаголовокСозданнойФормы";
	Форма.ПоказатьНеМодально();
	ТекущийЗаголовок = Форма.Заголовок;

	юТест.ПроверитьРавенство(ТекущийЗаголовок, "ЗаголовокСозданнойФормы");

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
